---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetPolyloop
source: html/6898037d-7f22-d4b7-4805-2f063c0f87c0.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening.GetPolyloop Method

Gets the planar polygon describing the opening geometry.

## Syntax (C#)
```csharp
public Polyloop GetPolyloop()
```

## Remarks
A planar polygon describing the surface geometry as described
 in gbXML. The geometry is currently measured per analytical(center-line).